# DoDragDrop Method (Object, IDropHandler)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIApplication..::..DoDragDrop Method (Object, IDropHandler)
UIApplication Class See Also
---
Initiates a drag and drop operation with a custom drop implementation.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static void DoDragDrop(
	Object dropData,
	IDropHandler handler
)
```

Visual Basic
---
```text
Public Shared Sub DoDragDrop ( _
	dropData As Object, _
	handler As IDropHandler _
)
```

Visual C++
---
```text
public:
static void DoDragDrop(
	Object^ dropData,
	IDropHandler^ handler
)
```

# ### Parameters
dropData
    Type: System..::..ObjectAny arbitrary data to be passed to the drop handler when the drop occurs.
handler
    Type: Autodesk.Revit.UI..::..IDropHandlerThe handler to be executed when the drop occurs.
# Remarks
When the user inputs IControllableDropHandler, it allows the handler to verify whether the drop event can be executed on the given view; When the user inputs IDropHandler the handler will be executed without any condition.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when dropData or handler is nullNothingnullptra null reference (Nothing in Visual Basic). |

# See Also
UIApplication Class
DoDragDrop Overload
Autodesk.Revit.UI Namespace